docker-compose-app.yml]:flask/python/lib/python3.7/site-packages/keystoneauth1/tests/unit/extras/saml2/fixtures/templates/authn_request.xml

<?xml version="1.0" encoding="UTF-8"?>
<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/">
    <S:Body>
        <samlp:AuthnRequest
                xmlns:samlp="urn:oasis:names:tc:SAML:2.0:protocol"
                AssertionConsumerServiceURL="https://openstack4.local/Shibboleth.sso/SAML2/ECP"
                ID="_a07186e3992e70e92c17b9d249495643"
                IssueInstant="2014-06-09T09:48:57Z"
                ProtocolBinding="urn:oasis:names:tc:SAML:2.0:bindings:PAOS"
                Version="2.0">
            <saml:Issuer xmlns:saml="urn:oasis:names:tc:SAML:2.0:assertion">
                $issuer
            </saml:Issuer>
            <samlp:NameIDPolicy AllowCreate="1"/>
            <samlp:Scoping>
                <samlp:IDPList>
                    <samlp:IDPEntry ProviderID="https://idp.testshib.org/idp/shibboleth"/>
                </samlp:IDPList>
            </samlp:Scoping>
        </samlp:AuthnRequest>
    </S:Body>
</S:Envelope>
